# Exploratory Data Analysis (EDA)

In [3]:
import numpy as np
import seaborn as sns
import pandas as pd
#pd.set_option('display.max_rows', None)
pd.set_option('display.max_columns', None)

In [4]:
# Task 1: Read the Titanic dataset from the Seaborn library.

# Görev 1: Seaborn kütüphanesi içerisinden Titanic veri setini tanımlayınız.

df = sns.load_dataset("titanic")

In [5]:
df.head(10)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
7,0,3,male,2.0,3,1,21.0750,S,Third,child,False,NaN,Southampton,no,False
8,1,3,female,27.0,0,2,11.1333,S,Third,woman,False,NaN,Southampton,yes,False
9,1,2,female,14.0,1,0,30.0708,C,Second,child,False,NaN,Cherbourg,yes,False

In [6]:
df.shape

(891, 15)

In [7]:
df.info

<bound method DataFrame.info of      survived  pclass     sex   age  sibsp  parch     fare embarked   class  \
0           0       3    male  22.0      1      0   7.2500        S   Third
1           1       1  female  38.0      1      0  71.2833        C   First
2           1       3  female  26.0      0      0   7.9250        S   Third
3           1       1  female  35.0      1      0  53.1000        S   First
4           0       3    male  35.0      0      0   8.0500        S   Third
..        ...     ...     ...   ...    ...    ...      ...      ...     ...
886         0       2    male  27.0      0      0  13.0000        S  Second
887         1       1  female  19.0      0      0  30.0000        S   First
888         0       3  female   NaN      1      2  23.4500        S   Third
889         1       1    male  26.0      0      0  30.0000        C   First
890         0       3    male  32.0      0      0   7.7500        Q   Third

       who  adult_male deck  embark_town alive  alone
0      man        True  NaN  Southampton    no  False
1    woman       False    C    Cherbourg   yes  False
2    woman       False  NaN  Southampton   yes   True
3    woman       False    C  Southampton   yes  False
4      man        True  NaN  Southampton    no   True
..     ...         ...  ...          ...   ...    ...
886    man        True  NaN  Southampton    no   True
887  woman       False    B  Southampton   yes   True
888  woman       False  NaN  Southampton    no  False
889    man        True    C    Cherbourg   yes   True
890    man        True  NaN   Queenstown    no   True

[891 rows x 15 columns]>

In [8]:
df.dtypes

survived          int64
pclass            int64
sex              object
age             float64
sibsp             int64
parch             int64
fare            float64
embarked         object
class          category
who              object
adult_male         bool
deck           category
embark_town      object
alive            object
alone              bool
dtype: object

In [9]:
# Task 2: Find the number of male and female passengers in the Titanic dataset. 

# Görev 2: Yukarıda tanımlanan Titanic veri setindeki kadın ve erkek yolcuların sayısını bulunuz.

df["sex"].value_counts()

male      577
female    314
Name: sex, dtype: int64

In [10]:
# Task 3: Find the number of unique values for each column.

# Görev 3: Her bir sutuna ait unique değerlerin sayısını bulunuz.

df.nunique()

survived         2
pclass           3
sex              2
age             88
sibsp            7
parch            7
fare           248
embarked         3
class            3
who              3
adult_male       2
deck             7
embark_town      3
alive            2
alone            2
dtype: int64

In [11]:
# Task 4: Find the unique values of the variable pclass.

# Görev 4: pclass değişkeninin unique değerlerini bulunuz.

df["pclass"].unique()

array([3, 1, 2])

In [12]:
# Task 5: Find the number of unique values of pclass and parch variables. 

# Görev 5: pclass ve parch değişkenlerinin unique değerlerinin sayısını bulunuz.

df[["pclass","parch"]].nunique()

pclass    3
parch     7
dtype: int64

In [13]:
df["embarked"].unique()

array(['S', 'C', 'Q', nan], dtype=object)

In [15]:
df["embarked"].dtype

dtype('O')

In [20]:
# Task 6: Check the type of the embarked variable. Change its type to category. Check the type, again.

# Görev 6: embarked değişkeninin tipini kontrol ediniz. Tipini category olarak değiştiriniz. Tekrar tipini kontrol ediniz.

df["embarked"] = df["embarked"].astype("category")

In [21]:
df["embarked"].dtype

CategoricalDtype(categories=['C', 'Q', 'S'], ordered=False)

In [22]:
# Task 7: Show all the information whose embarked value is C.

# Görev 7: embarked değeri C olanların tüm bilgelerini gösteriniz.

df[df["embarked"] == "C"].head(10)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
9,1,2,female,14.0,1,0,30.0708,C,Second,child,False,NaN,Cherbourg,yes,False
19,1,3,female,NaN,0,0,7.2250,C,Third,woman,False,NaN,Cherbourg,yes,True
26,0,3,male,NaN,0,0,7.2250,C,Third,man,True,NaN,Cherbourg,no,True
30,0,1,male,40.0,0,0,27.7208,C,First,man,True,NaN,Cherbourg,no,True
31,1,1,female,NaN,1,0,146.5208,C,First,woman,False,B,Cherbourg,yes,False
34,0,1,male,28.0,1,0,82.1708,C,First,man,True,NaN,Cherbourg,no,False
36,1,3,male,NaN,0,0,7.2292,C,Third,man,True,NaN,Cherbourg,yes,True
39,1,3,female,14.0,1,0,11.2417,C,Third,child,False,NaN,Cherbourg,yes,False
42,0,3,male,NaN,0,0,7.8958,C,Third,man,True,NaN,Cherbourg,no,True

In [67]:
# Task 8: Show all the information whose embarked value is not S.

# Görev 8: embarked değeri S olmayanların tüm bilgelerini gösteriniz.

df[df["embarked"] != "S"]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True
9,1,2,female,14.0,1,0,30.0708,C,Second,child,False,NaN,Cherbourg,yes,False
16,0,3,male,2.0,4,1,29.1250,Q,Third,child,False,NaN,Queenstown,no,False
19,1,3,female,NaN,0,0,7.2250,C,Third,woman,False,NaN,Cherbourg,yes,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
875,1,3,female,15.0,0,0,7.2250,C,Third,child,False,NaN,Cherbourg,yes,True
879,1,1,female,56.0,0,1,83.1583,C,First,woman,False,C,Cherbourg,yes,False
885,0,3,female,39.0,0,5,29.1250,Q,Third,woman,False,NaN,Queenstown,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [73]:
# Task 9: Show all information for female passengers younger than 30 years old.

# Görev 9: Yaşı 30 dan küçük ve kadın olan yolcuların tüm bilgilerini gösteriniz.

df[(df["sex"] == "female") & (df["age"] < 30)]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
8,1,3,female,27.0,0,2,11.1333,S,Third,woman,False,NaN,Southampton,yes,False
9,1,2,female,14.0,1,0,30.0708,C,Second,child,False,NaN,Cherbourg,yes,False
10,1,3,female,4.0,1,1,16.7000,S,Third,child,False,G,Southampton,yes,False
14,0,3,female,14.0,0,0,7.8542,S,Third,child,False,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
874,1,2,female,28.0,1,0,24.0000,C,Second,woman,False,NaN,Cherbourg,yes,False
875,1,3,female,15.0,0,0,7.2250,C,Third,child,False,NaN,Cherbourg,yes,True
880,1,2,female,25.0,0,1,26.0000,S,Second,woman,False,NaN,Southampton,yes,False
882,0,3,female,22.0,0,0,10.5167,S,Third,woman,False,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True

In [74]:
# Task 10: Show the information of passengers whose Fare is over 500 or 70 years old.

# Görev 10: Fare'i 500'den büyük veya yaşı 70 den büyük yolcuların bilgilerini gösteriniz.

df[(df["fare"] > 500) | (df["age"] > 70)]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
96,0,1,male,71.0,0,0,34.6542,C,First,man,True,A,Cherbourg,no,True
116,0,3,male,70.5,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True
258,1,1,female,35.0,0,0,512.3292,C,First,woman,False,NaN,Cherbourg,yes,True
493,0,1,male,71.0,0,0,49.5042,C,First,man,True,NaN,Cherbourg,no,True
630,1,1,male,80.0,0,0,30.0000,S,First,man,True,A,Southampton,yes,True
679,1,1,male,36.0,0,1,512.3292,C,First,man,True,B,Cherbourg,yes,False
737,1,1,male,35.0,0,0,512.3292,C,First,man,True,B,Cherbourg,yes,True
851,0,3,male,74.0,0,0,7.7750,S,Third,man,True,NaN,Southampton,no,True

In [76]:
# Task 11: Find the null values/missing values in each variable. 

# Görev 11: Her bir değişkendeki boş değerlerin toplamını bulunuz.

df.isnull().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [26]:
# Task 12: Drop the who variable from the dataframe.

# Görev 12: who değişkenini dataframe'den düşürün.

df.drop("who", axis=1, inplace=True)
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,True,NaN,Southampton,no,True

In [34]:
# Task 13: Fill the missing values in the deck variable with the most repeated value (mode) of the deck variable. 

# Görev 13: deck değişkenindeki boş değerleri deck değişkenin en çok tekrar eden değeri (mode) ile doldurunuz.

df["deck"].head(10)

0    C
1    C
2    C
3    C
4    C
5    C
6    E
7    C
8    C
9    C
Name: deck, dtype: category
Categories (7, object): ['A', 'B', 'C', 'D', 'E', 'F', 'G']

In [35]:
df["deck"].mode()

0    C
Name: deck, dtype: category
Categories (7, object): ['A', 'B', 'C', 'D', 'E', 'F', 'G']

In [50]:
deck_mode = df["deck"].mode()[0]
deck_mode

'C'

In [52]:
df["deck"].fillna(deck_mode, inplace=True)
deck_mode

'C'

In [93]:
# Task 14: Fill the missing values in the age variable with the median of the age variable.

# Görev 14: age değikenindeki boş değerleri age değişkenin medyanı ile doldurun.

x = df["age"].median()
x

28.0

In [55]:
# Task 15: Find the sum, count, mean values of the survived variable in the breakdown of the pclass and gender variables. 

# Görev 15: survived değişkeninin Pclass ve Cinsiyet değişkenleri kırılımınında sum, count, mean değerlerini bulunuz.

df.groupby(["pclass","sex"]).agg({"survived":["sum","count","mean"]})

              survived
                   sum count      mean
pclass sex
1      female       91    94  0.968085
       male         45   122  0.368852
2      female       70    76  0.921053
       male         17   108  0.157407
3      female       72   144  0.500000
       male         47   347  0.135447

In [54]:
# Task 16: Write a function that returns 1 for whose age is under 30, 0 for whose age is greater than or equal to 30.
# Create a variable named age_flag in the titanic data set using the function you wrote.
# (use apply and lambda functions)


# Görev 16: 30 yaşın altında olanlar 1, 30'a eşit ve üstünde olanlara 0 vericek bir fonksiyon yazınız.
# Yazdığınız fonksiyonu kullanarak titanik veri setinde age_flag adında bir değişken oluşturunuz oluşturunuz. 
# (apply ve lambda yapılarını kullanınız)

In [64]:
def age_30(age):
    if age<30:
        return 1
    else:
        return 0

In [66]:
df["age_flag"] = df["age"].apply(lambda x : age_30(x))
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,adult_male,deck,embark_town,alive,alone,age_flag
0,0,3,male,22.0,1,0,7.2500,S,Third,True,C,Southampton,no,False,1
1,1,1,female,38.0,1,0,71.2833,C,First,False,C,Cherbourg,yes,False,0
2,1,3,female,26.0,0,0,7.9250,S,Third,False,C,Southampton,yes,True,1
3,1,1,female,35.0,1,0,53.1000,S,First,False,C,Southampton,yes,False,0
4,0,3,male,35.0,0,0,8.0500,S,Third,True,C,Southampton,no,True,0

In [67]:
# Task 17: Read the Tips dataset from the Seaborn library.

# Görev 17: Seaborn kütüphanesi içerisinden Tips veri setini tanımlayınız.

df = sns.load_dataset("tips")
df.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [69]:
# Task 18: Find the sum, min, max and average of total_bill values 
# with respect to the categories (Dinner, Lunch) of Time variable.


# Görev 18: Time değişkeninin kategorilerine (Dinner, Lunch) göre total_bill  
# değerlerinin toplamını, min, max ve ortalamasını bulunuz.

df.groupby(df["time"]).agg({"total_bill" : ["sum","min","max","mean"]})

       total_bill
              sum   min    max       mean
time
Lunch     1167.47  7.51  43.11  17.168676
Dinner    3660.30  3.07  50.81  20.797159

In [71]:
# Task 19: Find the sum, min, max and average of total_bill values by days and time.

# Görev 19: Günlere ve time göre total_bill değerlerinin toplamını, min, max ve ortalamasını bulunuz.

df.groupby(["day","time"]).agg({"total_bill" : ["sum","min","max","mean"]})

            total_bill
                   sum    min    max       mean
day  time
Thur Lunch     1077.55   7.51  43.11  17.664754
     Dinner      18.78  18.78  18.78  18.780000
Fri  Lunch       89.92   8.58  16.27  12.845714
     Dinner     235.96   5.75  40.17  19.663333
Sat  Lunch        0.00    NaN    NaN        NaN
     Dinner    1778.40   3.07  50.81  20.441379
Sun  Lunch        0.00    NaN    NaN        NaN
     Dinner    1627.16   7.25  48.17  21.410000

In [76]:
# Task 20: Find the sum, min, max and average values of the total_bill and tip variables according to day
# for Lunch time and female customers.


# Görev 20:Lunch zamanına ve kadın müşterilere ait total_bill ve tip  
# değerlerinin day'e göre toplamını, min, max ve ortalamasını bulunuz.

df[(df["time"]=="Lunch") & (df["sex"]=="Female")].groupby("day").agg({"total_bill" : ["sum","min","max","mean"], 
                                                                          "tip" : ["sum","min","max","mean"]})

     total_bill                            tip
            sum    min    max      mean    sum   min   max      mean
day
Thur     516.11   8.35  43.11  16.64871  79.42  1.25  5.17  2.561935
Fri       55.76  10.09  16.27  13.94000  10.98  2.00  3.48  2.745000
Sat        0.00    NaN    NaN       NaN   0.00   NaN   NaN       NaN
Sun        0.00    NaN    NaN       NaN   0.00   NaN   NaN       NaN

In [105]:
# Task 21: What is the average of orders with size less than 3 and total_bill greater than 10?

# Görev 21: size'i 3'ten küçük, total_bill'i 10'dan büyük olan siparişlerin ortalaması nedir?


df.loc[(df["size"]<3) & (df["total_bill"]>10),"total_bill"].mean()

17.18496503496505

In [114]:
# Task 22: Create a new variable called total_bill_tip_sum,
# which gives the sum of the total bill and tip paid by each customer.


# Görev 22: total_bill_tip_sum adında yeni bir değişken oluşturun. 
# Her bir müşterinin ödediği totalbill ve tip in toplamını versin.

df["total_bill_tip"] = df["total_bill"] + df["tip"]
df.head()

   total_bill   tip     sex smoker  day    time  size  total_bill_tip
0       16.99  1.01  Female     No  Sun  Dinner     2           18.00
1       10.34  1.66    Male     No  Sun  Dinner     3           12.00
2       21.01  3.50    Male     No  Sun  Dinner     3           24.51
3       23.68  3.31    Male     No  Sun  Dinner     2           26.99
4       24.59  3.61  Female     No  Sun  Dinner     4           28.20

In [125]:
# Task 23: Find the mean of the total_bill variable for men and women separately.
# 0 is given to those whose averages less than you have found, and 1 is given to those whose averages greater than or equal to 
# you have found.
# Create a new total_bill_flag variable.
# Attention !! For females, the average for females will be taken into account, and for male, the average for males will 
# be taken into account.
# Start by writing a function that takes a gender and total_bill as a parameter (will include if-else conditions).



# Görev 23: Total_bill değişkeninin kadın ve erkek için ayrı ayrı ortalamasını bulun.
# Bulduğunuz ortalamaların altında olanlara 0, üstünde ve eşit olanlara bir verildiği 
# yeni bir total_bill_flag değişkeni oluşturun.
# Dikkat !! Female olanlar için kadınlar için bulunan ortalama dikkate alıncak, male için ise erkekler için bulunan ortalama.
# parametre olarak cinsiyet ve total_bill alan bir fonksiyon yazarak başlayın. (If-else koşulları içerecek)


female_avg = df[df["sex"] == "Female"]["total_bill"].mean()
female_avg

18.056896551724137

In [128]:
male_avg = df[df["sex"] == "Male"]["total_bill"].mean()
male_avg

20.744076433121034

In [129]:
def func (sex, total_bill):
    if "sex" == "Female":
        if total_bill >= female_avg:
            return 1
        else:
            return 0
    else:
        if total_bill >= male_avg:
            return 1
        else:
            return 0

In [133]:
df["total_bill_flag"] = df.apply(lambda x : func(x["sex"],x["total_bill"]), axis=1)
df.head(20)

,total_bill,tip,sex,smoker,day,time,size,total_bill_tip,total_bill_flag
0,16.99,1.01,Female,No,Sun,Dinner,2,18.00,0
1,10.34,1.66,Male,No,Sun,Dinner,3,12.00,0
2,21.01,3.50,Male,No,Sun,Dinner,3,24.51,1
3,23.68,3.31,Male,No,Sun,Dinner,2,26.99,1
4,24.59,3.61,Female,No,Sun,Dinner,4,28.20,1
5,25.29,4.71,Male,No,Sun,Dinner,4,30.00,1
6,8.77,2.00,Male,No,Sun,Dinner,2,10.77,0
7,26.88,3.12,Male,No,Sun,Dinner,4,30.00,1
8,15.04,1.96,Male,No,Sun,Dinner,2,17.00,0
9,14.78,3.23,Male,No,Sun,Dinner,2,18.01,0
10,10.27,1.71,Male,No,Sun,Dinner,2,11.98,0
11,35.26,5.00,Female,No,Sun,Dinner,4,40.26,1
12,15.42,1.57,Male,No,Sun,Dinner,2,16.99,0
13,18.43,3.00,Male,No,Sun,Dinner,4,21.43,0
14,14.83,3.02,Female,No,Sun,Dinner,2,17.85,0
15,21.58,3.92,Male,No,Sun,Dinner,2,25.50,1
16,10.33,1.67,Female,No,Sun,Dinner,3,12.00,0
17,16.29,3.71,Male,No,Sun,Dinner,3,20.00,0
18,16.97,3.50,Female,No,Sun,Dinner,3,20.47,0
19,20.65,3.35,Male,No,Sat,Dinner,3,24.00,0

In [137]:
# Task 24: Using the total_bill_flag variable, find the number of observations whose average is smaller or greater 
# than what you have found.



# Görev 24: total_bill_flag değişkenini kullanarak cinsiyetlere göre ortalamanın 
# altında ve üstünde olanların sayısını gözlemleyin.

df.groupby(["sex","total_bill_flag"]).agg({"total_bill_flag" :"count"})

                        total_bill_flag
sex    total_bill_flag
Male   0                             95
       1                             62
Female 0                             63
       1                             24

In [140]:
# Task 25: Sort from largest to smallest according to the total_bill_tip_sum variable 
# and assign the first 30 people to a new dataframe.


# Görev 25: total_bill_tip_sum değişkenine göre büyükten küçüğe sıralayınız ve ilk 30 kişiyi yeni bir dataframe'e atayınız.

new_df = df.sort_values("total_bill_tip", ascending = False)[:30]
new_df.head()

,total_bill,tip,sex,smoker,day,time,size,total_bill_tip,total_bill_flag
170,50.81,10.00,Male,Yes,Sat,Dinner,3,60.81,1
212,48.33,9.00,Male,No,Sat,Dinner,4,57.33,1
59,48.27,6.73,Male,No,Sat,Dinner,4,55.00,1
156,48.17,5.00,Male,No,Sun,Dinner,6,53.17,1
182,45.35,3.50,Male,Yes,Sun,Dinner,3,48.85,1